--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 21, gadget_id = 70900225, pos = { x = 118.4, y = -5.9, z = 55.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, route_id = 1012006, start_route = false },
	{ config_id = 22, gadget_id = 70900226, pos = { x = 118.6, y = 10.3, z = 81.1 }, rot = { x = 0.0, y = 180.0, z = 0.0 }, level = 1, route_id = 1012003, start_route = false },
	{ config_id = 23, gadget_id = 70900226, pos = { x = 144.0, y = 9.9, z = 55.1 }, rot = { x = 0.0, y = 270.0, z = 0.0 }, level = 1, route_id = 1012002, start_route = false },
	{ config_id = 24, gadget_id = 70900226, pos = { x = 92.3, y = 10.7, z = 55.6 }, rot = { x = 0.0, y = 90.0, z = 0.0 }, level = 1, route_id = 1012004, start_route = false },
	{ config_id = 25, gadget_id = 70900226, pos = { x = 118.1, y = 10.9, z = 29.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, route_id = 1012001 },
	{ config_id = 26, gadget_id = 70900225, pos = { x = 118.1, y = 21.5, z = 54.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, route_id = 1012005, start_route = false }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { },
		gadgets = { 21, 22, 23, 24, 25, 26 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
