--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 1059, monster_id = 28020102, pos = { x = 2799.9, y = 259.5, z = -1260.7 }, rot = { x = 0.0, y = 21.7, z = 0.0 }, level = 0, disableWander = true },
	{ config_id = 1060, monster_id = 28020102, pos = { x = 2799.5, y = 259.5, z = -1259.9 }, rot = { x = 0.0, y = 103.5, z = 0.0 }, level = 0, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3316, gadget_id = 70500000, pos = { x = 2800.4, y = 259.6, z = -1260.2 }, rot = { x = 0.0, y = 228.5, z = 0.0 }, level = 1, point_type = 2006 },
	{ config_id = 3317, gadget_id = 70500000, pos = { x = 2800.1, y = 259.6, z = -1260.1 }, rot = { x = 0.0, y = 316.3, z = 0.0 }, level = 1, point_type = 2006 },
	{ config_id = 3318, gadget_id = 70500000, pos = { x = 2800.5, y = 259.6, z = -1259.9 }, rot = { x = 0.0, y = 27.7, z = 0.0 }, level = 1, point_type = 2006 },
	{ config_id = 3319, gadget_id = 70290002, pos = { x = 2783.4, y = 260.8, z = -1295.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 3320, gadget_id = 70500000, pos = { x = 2782.3, y = 262.4, z = -1295.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3001, owner = 3319 },
	{ config_id = 3321, gadget_id = 70500000, pos = { x = 2784.2, y = 263.4, z = -1296.7 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3001, owner = 3319 },
	{ config_id = 3322, gadget_id = 70500000, pos = { x = 2783.4, y = 263.7, z = -1294.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3001, owner = 3319 },
	{ config_id = 3329, gadget_id = 70500000, pos = { x = 2801.3, y = 261.1, z = -1289.6 }, rot = { x = 0.0, y = 337.8, z = 0.0 }, level = 1, point_type = 2004 },
	{ config_id = 3330, gadget_id = 70500000, pos = { x = 2852.9, y = 263.7, z = -1313.7 }, rot = { x = 0.0, y = 165.4, z = 0.0 }, level = 1, point_type = 2001 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { 1059, 1060 },
		gadgets = { 3316, 3317, 3318, 3319, 3320, 3321, 3322, 3329, 3330 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
