--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 926, monster_id = 28030101, pos = { x = 2824.6, y = 307.2, z = -1607.2 }, rot = { x = 0.0, y = 127.8, z = 0.0 }, level = 0 },
	{ config_id = 1068, monster_id = 28020102, pos = { x = 2691.8, y = 274.0, z = -1535.9 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 0 },
	{ config_id = 1069, monster_id = 28030101, pos = { x = 2618.7, y = 265.8, z = -1588.8 }, rot = { x = 0.0, y = 235.2, z = 0.0 }, level = 0, pose_id = 2 },
	{ config_id = 1095, monster_id = 28020102, pos = { x = 2780.9, y = 293.9, z = -1602.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 0 },
	{ config_id = 1096, monster_id = 28020102, pos = { x = 2710.2, y = 274.5, z = -1592.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 0 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3026, gadget_id = 70500000, pos = { x = 2814.8, y = 312.6, z = -1585.9 }, rot = { x = 0.0, y = 134.6, z = 0.0 }, level = 1, point_type = 4001001, isOneoff = true },
	{ config_id = 3338, gadget_id = 70290002, pos = { x = 2787.3, y = 295.3, z = -1615.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 3339, gadget_id = 70500000, pos = { x = 2786.2, y = 296.9, z = -1614.6 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3001, owner = 3338 },
	{ config_id = 3340, gadget_id = 70500000, pos = { x = 2788.1, y = 297.9, z = -1616.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3001, owner = 3338 },
	{ config_id = 3341, gadget_id = 70500000, pos = { x = 2787.3, y = 298.2, z = -1614.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3001, owner = 3338 },
	{ config_id = 3342, gadget_id = 70500000, pos = { x = 2782.0, y = 294.0, z = -1588.4 }, rot = { x = 0.0, y = 173.2, z = 0.0 }, level = 1, point_type = 2001 },
	{ config_id = 3343, gadget_id = 70500000, pos = { x = 2744.9, y = 281.8, z = -1558.4 }, rot = { x = 0.0, y = 3.1, z = 0.0 }, level = 1, point_type = 2004 },
	{ config_id = 3344, gadget_id = 70500000, pos = { x = 2670.5, y = 270.2, z = -1554.7 }, rot = { x = 0.0, y = 245.1, z = 0.0 }, level = 1, point_type = 2001 },
	{ config_id = 3436, gadget_id = 70290001, pos = { x = 2732.6, y = 280.3, z = -1598.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 3437, gadget_id = 70500000, pos = { x = 2732.6, y = 280.9, z = -1598.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3002, owner = 3436 },
	{ config_id = 3438, gadget_id = 70500000, pos = { x = 2732.5, y = 281.2, z = -1598.8 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3002, owner = 3436 },
	{ config_id = 3439, gadget_id = 70500000, pos = { x = 2732.9, y = 281.6, z = -1598.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3002, owner = 3436 },
	{ config_id = 3440, gadget_id = 70500000, pos = { x = 2745.9, y = 283.8, z = -1607.7 }, rot = { x = 0.0, y = 210.1, z = 0.0 }, level = 1, point_type = 2007 },
	{ config_id = 3441, gadget_id = 70500000, pos = { x = 2745.0, y = 283.7, z = -1610.3 }, rot = { x = 0.0, y = 234.9, z = 0.0 }, level = 1, point_type = 2007 },
	{ config_id = 3442, gadget_id = 70500000, pos = { x = 2744.8, y = 283.6, z = -1608.2 }, rot = { x = 0.0, y = 298.4, z = 0.0 }, level = 1, point_type = 2007 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { 926, 1068, 1069, 1095, 1096 },
		gadgets = { 3026, 3338, 3339, 3340, 3341, 3342, 3343, 3344, 3436, 3437, 3438, 3439, 3440, 3441, 3442 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
