--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 279, monster_id = 21010401, pos = { x = 2474.0, y = 218.1, z = -59.0 }, rot = { x = 0.0, y = 51.3, z = 0.0 }, level = 18, drop_id = 303004, disableWander = true, pose_id = 9003 },
	{ config_id = 281, monster_id = 21010701, pos = { x = 2477.1, y = 217.9, z = -59.3 }, rot = { x = 0.0, y = 319.0, z = 0.0 }, level = 20, drop_id = 303005, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 668, gadget_id = 70210021, pos = { x = 2475.8, y = 218.0, z = -61.0 }, rot = { x = 0.0, y = 339.3, z = 0.0 }, level = 1, chest_drop_id = 403105, isOneoff = true, persistent = true },
	{ config_id = 669, gadget_id = 70310006, pos = { x = 2475.5, y = 218.0, z = -58.0 }, rot = { x = 0.0, y = 182.5, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 670, gadget_id = 70220013, pos = { x = 2471.2, y = 218.2, z = -57.3 }, rot = { x = 0.0, y = 314.1, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { 279, 281 },
		gadgets = { 668, 669, 670 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
