--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 1755, gadget_id = 70500000, pos = { x = 2004.2, y = 221.0, z = -1544.1 }, rot = { x = 0.0, y = 346.6, z = 0.0 }, level = 1, point_type = 3007 },
	{ config_id = 1756, gadget_id = 70500000, pos = { x = 2029.7, y = 222.4, z = -1554.7 }, rot = { x = 0.0, y = 63.5, z = 0.0 }, level = 1, point_type = 3007 },
	{ config_id = 1757, gadget_id = 70500000, pos = { x = 2028.3, y = 221.5, z = -1573.9 }, rot = { x = 0.0, y = 0.5, z = 0.0 }, level = 1, point_type = 3007 },
	{ config_id = 1758, gadget_id = 70500000, pos = { x = 2011.8, y = 221.2, z = -1537.8 }, rot = { x = 0.0, y = 54.1, z = 0.0 }, level = 1, point_type = 3007 },
	{ config_id = 1759, gadget_id = 70500000, pos = { x = 2017.4, y = 221.5, z = -1560.8 }, rot = { x = 0.0, y = 185.4, z = 0.0 }, level = 1, point_type = 3007 },
	{ config_id = 1760, gadget_id = 70500000, pos = { x = 2002.0, y = 221.1, z = -1524.3 }, rot = { x = 0.0, y = 122.0, z = 0.0 }, level = 1, point_type = 3007 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
	{ name = "door1", value = 0, persistent = false },
	{ name = "door2", value = 0, persistent = false },
	{ name = "door3", value = 0, persistent = false }
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { },
		gadgets = { 1755, 1756, 1757, 1758, 1759, 1760 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
