--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 249, monster_id = 21010401, pos = { x = 2636.3, y = 207.0, z = -11.2 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 18, drop_id = 303004, disableWander = true, pose_id = 9002 },
	{ config_id = 250, monster_id = 21010401, pos = { x = 2638.2, y = 207.0, z = -5.5 }, rot = { x = 0.0, y = 165.0, z = 0.0 }, level = 18, drop_id = 303004, disableWander = true, pose_id = 9002 },
	{ config_id = 251, monster_id = 21010701, pos = { x = 2640.2, y = 207.0, z = -10.2 }, rot = { x = 0.0, y = 309.2, z = 0.0 }, level = 20, drop_id = 303005, disableWander = true }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 527, gadget_id = 70210021, pos = { x = 2635.7, y = 207.0, z = -6.8 }, rot = { x = 0.0, y = 124.3, z = 0.0 }, level = 1, chest_drop_id = 403105, isOneoff = true, persistent = true },
	{ config_id = 528, gadget_id = 70310004, pos = { x = 2638.2, y = 207.0, z = -8.8 }, rot = { x = 0.0, y = 182.5, z = 0.0 }, level = 1, state = GadgetState.GearStart },
	{ config_id = 529, gadget_id = 70220013, pos = { x = 2633.9, y = 207.0, z = -8.1 }, rot = { x = 0.0, y = 314.1, z = 0.0 }, level = 1 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { 249, 250, 251 },
		gadgets = { 527, 528, 529 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
