--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 922, monster_id = 21030101, pos = { x = 2680.6, y = 244.4, z = -1276.8 }, rot = { x = 0.0, y = 70.4, z = 0.0 }, level = 15, drop_id = 303003, disableWander = true },
	{ config_id = 1034, monster_id = 21010901, pos = { x = 2680.2, y = 244.7, z = -1279.9 }, rot = { x = 0.0, y = 16.4, z = 0.0 }, level = 10, drop_id = 303002, disableWander = true, pose_id = 9003 },
	{ config_id = 1035, monster_id = 21010101, pos = { x = 2692.2, y = 244.0, z = -1267.4 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 10, drop_id = 303002, pose_id = 9003 },
	{ config_id = 1036, monster_id = 20011001, pos = { x = 2682.7, y = 244.3, z = -1276.4 }, rot = { x = 0.0, y = 287.0, z = 0.0 }, level = 10, drop_id = 303002, disableWander = true },
	{ config_id = 1037, monster_id = 21010101, pos = { x = 2682.9, y = 244.2, z = -1278.4 }, rot = { x = 0.0, y = 334.6, z = 0.0 }, level = 10, drop_id = 303002, disableWander = true, pose_id = 9003 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3288, gadget_id = 70500000, pos = { x = 2708.7, y = 244.8, z = -1271.6 }, rot = { x = 0.0, y = 242.9, z = 0.0 }, level = 1, point_type = 1002 },
	{ config_id = 3289, gadget_id = 70500000, pos = { x = 2709.0, y = 245.0, z = -1277.9 }, rot = { x = 315.7, y = 209.4, z = 196.2 }, level = 1, point_type = 1002 },
	{ config_id = 3290, gadget_id = 70290008, pos = { x = 2687.7, y = 243.9, z = -1282.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 3291, gadget_id = 70500000, pos = { x = 2687.7, y = 243.9, z = -1282.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 1, point_type = 3008, owner = 3290 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { 922, 1034, 1035, 1036, 1037 },
		gadgets = { 3288, 3289, 3290, 3291 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
