--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 2800, gadget_id = 70500000, pos = { x = 1600.5, y = 246.2, z = -1670.7 }, rot = { x = 0.0, y = 18.6, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2801, gadget_id = 70500000, pos = { x = 2031.2, y = 224.9, z = -1507.0 }, rot = { x = 0.0, y = 4.3, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2802, gadget_id = 70500000, pos = { x = 1543.0, y = 300.0, z = -1122.2 }, rot = { x = 0.0, y = 359.9, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2803, gadget_id = 70500000, pos = { x = 1239.7, y = 302.5, z = -1328.6 }, rot = { x = 0.0, y = 59.1, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2804, gadget_id = 70500000, pos = { x = 1709.2, y = 270.9, z = -1109.0 }, rot = { x = 0.0, y = 47.3, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2805, gadget_id = 70500000, pos = { x = 1643.7, y = 276.0, z = -1516.1 }, rot = { x = 0.0, y = 210.7, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2806, gadget_id = 70500000, pos = { x = 1632.2, y = 246.0, z = -1598.4 }, rot = { x = 0.0, y = 214.3, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2807, gadget_id = 70500000, pos = { x = 2001.3, y = 219.7, z = -1593.4 }, rot = { x = 0.0, y = 111.9, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2808, gadget_id = 70500000, pos = { x = 1647.8, y = 274.4, z = -1486.1 }, rot = { x = 0.0, y = 135.8, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2809, gadget_id = 70500000, pos = { x = 1412.0, y = 302.7, z = -1866.9 }, rot = { x = 0.0, y = 185.1, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2810, gadget_id = 70500000, pos = { x = 1314.0, y = 269.3, z = -1448.9 }, rot = { x = 0.0, y = 194.8, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2811, gadget_id = 70500000, pos = { x = 1578.6, y = 248.1, z = -1385.6 }, rot = { x = 0.0, y = 346.0, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2812, gadget_id = 70500000, pos = { x = 1487.7, y = 302.9, z = -1163.8 }, rot = { x = 0.0, y = 273.9, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2813, gadget_id = 70500000, pos = { x = 1192.4, y = 284.6, z = -1652.9 }, rot = { x = 0.0, y = 333.4, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2814, gadget_id = 70500000, pos = { x = 1494.6, y = 243.5, z = -1419.9 }, rot = { x = 0.0, y = 275.6, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2815, gadget_id = 70500000, pos = { x = 1419.6, y = 310.9, z = -1939.5 }, rot = { x = 0.0, y = 253.0, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2816, gadget_id = 70500000, pos = { x = 1281.7, y = 302.3, z = -1758.4 }, rot = { x = 0.0, y = 120.8, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2817, gadget_id = 70500000, pos = { x = 1515.9, y = 272.1, z = -1536.8 }, rot = { x = 0.0, y = 268.6, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2818, gadget_id = 70500000, pos = { x = 1237.3, y = 318.8, z = -1861.2 }, rot = { x = 0.0, y = 342.9, z = 0.0 }, level = 1, point_type = 2009 },
	{ config_id = 2819, gadget_id = 70500000, pos = { x = 1203.4, y = 268.1, z = -1679.1 }, rot = { x = 0.0, y = 317.6, z = 0.0 }, level = 1, point_type = 2009 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { },
		gadgets = { 2800, 2801, 2802, 2803, 2804, 2805, 2806, 2807, 2808, 2809, 2810, 2811, 2812, 2813, 2814, 2815, 2816, 2817, 2818, 2819 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
