--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 280, gadget_id = 70290009, pos = { x = 2111.9, y = 240.6, z = -443.5 }, rot = { x = 337.6, y = 0.0, z = 0.0 }, level = 1 },
	{ config_id = 281, gadget_id = 70500000, pos = { x = 2111.9, y = 240.6, z = -443.5 }, rot = { x = 337.6, y = 0.0, z = 0.0 }, level = 1, point_type = 3005, owner = 280 }
}

-- 区域
regions = {
	{ config_id = 69, shape = RegionShape.SPHERE, radius = 5, pos = { x = 2056.7, y = 243.8, z = -470.5 } }
}

-- 触发器
triggers = {
	{ name = "ENTER_REGION_69", event = EventType.EVENT_ENTER_REGION, source = "", condition = "", action = "" }
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { },
		gadgets = { 280, 281 },
		regions = { 69 },
		triggers = { "ENTER_REGION_69" },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================

-- 触发条件

-- 触发操作
