--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
	{ config_id = 376, monster_id = 28050101, pos = { x = 1870.8, y = 253.5, z = -566.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 9 },
	{ config_id = 382, monster_id = 28050101, pos = { x = 1860.6, y = 258.5, z = -573.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 9 },
	{ config_id = 385, monster_id = 28050101, pos = { x = 1885.4, y = 254.2, z = -524.5 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 9 },
	{ config_id = 386, monster_id = 28050101, pos = { x = 1869.5, y = 247.1, z = -521.0 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 9 },
	{ config_id = 392, monster_id = 28050101, pos = { x = 1856.9, y = 258.1, z = -574.3 }, rot = { x = 0.0, y = 0.0, z = 0.0 }, level = 9 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	rand_suite = true,
	npcs = { }
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 0,
		-- description = ,
		monsters = { 376 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 1,
		-- description = suite_2,
		monsters = { 382 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = suite_3,
		monsters = { 385, 386, 392 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
